CraigHutchinson/Sub0h264/test_apps/esp_shootout/sdkconfig.defaults
# test_apps/esp_shootout/sdkconfig.defaults
# ESP32-P4 config for Sub0h264 vs libavc shootout.

# ── Chip / flash ──────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# ── Chip revision ─────────────────────────────────────────────────────────────
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ── PSRAM (OPI, 200 MHz) — libavc needs PSRAM for output buffers ─────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y

# ── C++ ─────────────────────────────────────────────────────────────────────────
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=1024
CONFIG_COMPILER_CXX_RTTI=n

# ── CPU frequency — 360 MHz ────────────────────────────────────────────────────
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# ── Compiler optimisation ──────────────────────────────────────────────────────
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ── Watchdog: very generous for full shootout (libavc can be slow) ─────────────
CONFIG_ESP_TASK_WDT_TIMEOUT_S=120
CONFIG_ESP_TASK_WDT_PANIC=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# ── Stack: large for both decoders ────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=131072

# ── Log level ──────────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ── Disable Bluetooth ──────────────────────────────────────────────────────────
CONFIG_BT_ENABLED=n
